src/DataProcessors/РежимБрони.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>РежимБрони</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПосадочноеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПосадочныеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосетителей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Время1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Время2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаЗаказа</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяБронь</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимБронирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/СтатусыПозицийЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыПозицийЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дозаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заказано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТарифВкл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Бронь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Бронь</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Бронирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интернет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланМеню</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПосадочныеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПосадочноеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПосадочныеМеста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПосетителей</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>без скидок</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>без скидок</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специфики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТовара</Name>
							<Comment>для связи с товарами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специфика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Специфики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Comment>полностью, кратко в наименовании</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Comment>Код ручного доступа сотрудника к системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригадир</Name>
					<Comment>является бригадиром</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>для идентификации сотрудника как клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПланЗала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БригадыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Comment>является курьером доставки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пейджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветОповещенияГотовности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УР_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставБригады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПраваДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоРеализации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборПрав</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыПравДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/РежимБрони/Ext/ObjectModule.bsl
#Если Клиент Тогда

Перем ОбработкаЗаказ Экспорт;  // Ссылка на обработку "Заказ"

// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
	ИнициализацияРеквизитов();
	
КонецПроцедуры

Процедура ИнициализацияРеквизитов()
	
	ОбработкаЗаказ = ИнтерфейсРМ.ПолучитьОбъектОбработки("Заказ","РежимБрони");
	ОбработкаЗаказ.РежимПредЗаказ = Истина;
	// Получаем ТипЦен по месту реализации из посадочного места либо из рабочего места;
	УстановитьТипЦен();
	
	ТаблицаЗаказа = ОбработкаЗаказ.ТаблицаЗаказа;

КонецПроцедуры

// Установить ТипЦен при подборе Меню
//
Процедура УстановитьТипЦен() Экспорт

	ОбработкаЗаказ.ТипЦен = Защита.ПолучитьТипЦен(?(ЗначениеЗаполнено(ПосадочноеМесто) И ЗначениеЗаполнено(ПосадочноеМесто.МестоРеализации), ПосадочноеМесто.МестоРеализации, глРабочееМесто.МестоРеализации));	
	
КонецПроцедуры	

// Сохранение брони
//
Функция ЗаписатьБронь() Экспорт
	
	Если ПосадочноеМесто.Пустая() Тогда
		Текст1="Ошибка!";
		Текст2="Укажите посадочное место!";
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");
		Возврат Ложь;
		
	ИначеЕсли Время2 <= Время1 Тогда
		Текст1="Ошибка!";
		Текст2="Некорректный интервал бронирования!";
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");
		Возврат Ложь;
		
	ИначеЕсли НЕ( ЗначениеЗаполнено(КлиентСтр) ИЛИ ЗначениеЗаполнено(Клиент) ) Тогда
		Текст1="Ошибка!";
		Текст2="Укажите клиента...";
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");
		Возврат Ложь;
		
	КонецЕсли;
	
	
	Если ТекущаяБронь.Пустая() Тогда
		Бронь = Документы.Бронь.СоздатьДокумент();
	Иначе
		Бронь = ТекущаяБронь.ПолучитьОбъект();
		Бронь.ПосадочныеМеста.Очистить();
		Бронь.Товары.Очистить();
		Бронь.Специфики.Очистить();
	КонецЕсли;
	
	Бронь.Дата			= Время1;
	Бронь.Автор			= глПользователь;
	Бронь.ВремяНачала	= Время1;
	Бронь.ВремяКонца	= Время2;
	Бронь.ВремяЗапрета  = Время1-глПараметрыРМ.БроньВремяЗапрета*60;
	Бронь.Клиент		= Клиент;
	Бронь.Комментарий	= Комментарий;
	Бронь.КлиентСтр		= ?(ЗначениеЗаполнено(Клиент), Клиент.Наименование, КлиентСтр);
	
	// посадочное место
	СтрокаДок = Бронь.ПосадочныеМеста.Добавить();
	СтрокаДок.ПосадочноеМесто		= ПосадочноеМесто;
	СтрокаДок.КоличествоПосетителей = КоличествоПосетителей;
	
	// предварительный заказ
	Для каждого СтрокаТовара Из ТаблицаЗаказа.Строки Цикл
		СтрокаДок = Бронь.Товары.Добавить();
		СтрокаДок.Товар		= СтрокаТовара.Товар;
		СтрокаДок.Количество= СтрокаТовара.Количество;
		СтрокаДок.Цена		= СтрокаТовара.Цена;
		СтрокаДок.Сумма		= СтрокаТовара.Сумма;
		
		Для каждого СтрокаСпецифики Из СтрокаТовара.Строки Цикл
			СтрокаДокСпец = Бронь.Специфики.Добавить();
			СтрокаДокСпец.НомерСтрокиТовара	= СтрокаДок.НомерСтроки;
			СтрокаДокСпец.Специфика			= СтрокаСпецифики.Товар;
		КонецЦикла; 
		
	КонецЦикла;
	
	Бронь.БроньПроверена = Истина;
	
	Если НЕ ИнтерфейсРМ.ПопыткаДействияСОбъектом( Бронь, "Объект.Записать(РежимЗаписиДокумента.Проведение)" ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИнтерфейсРМ.ЗаписьСобытия(Справочники.События.БроньЗапись, Бронь.Ссылка, Бронь.Номер, НаимПосадочногоМеста(ПосадочноеМесто) );
	
	ТекущаяБронь = Бронь.Ссылка;
	
	Возврат Истина;
КонецФункции

// Прочитать параметры существующей брони
//
Функция ПрочитатьБронь() Экспорт
	
	Если ТекущаяБронь.ПосадочныеМеста.Количество() = 1 Тогда
		ПосадочноеМесто			= ТекущаяБронь.ПосадочныеМеста[0].ПосадочноеМесто;
		КоличествоПосетителей	= ТекущаяБронь.ПосадочныеМеста[0].КоличествоПосетителей;
		
	ИначеЕсли ТекущаяБронь.ПосадочныеМеста.Количество() > 1 Тогда
		Текст1="Нет доступа!";
		Текст2="Эта бронь на несколько мест, изменить её можно только в интерфейсе Администратора...";
		ИнтерфейсРМ.ВопросПредупреждение("Ошибка",Текст1,Текст2,"","ОК","");
		Возврат Ложь;
		
	КонецЕсли; 
	
	Время1		= ТекущаяБронь.ВремяНачала;
	Время2		= ТекущаяБронь.ВремяКонца;
	Клиент		= ТекущаяБронь.Клиент;
	КлиентСтр	= ТекущаяБронь.КлиентСтр;
	Комментарий	= ТекущаяБронь.Комментарий;
	
	Для каждого СтрокаДок Из ТекущаяБронь.Товары Цикл
		СтрокаТовара = ТаблицаЗаказа.Строки.Добавить();
		СтрокаТовара.Товар		= СтрокаДок.Товар;
		СтрокаТовара.Количество	= СтрокаДок.Количество;
		СтрокаТовара.Цена		= СтрокаДок.Цена;
		СтрокаТовара.Сумма		= СтрокаДок.Сумма;
		
		СтрокаТовара.Наименование		= СтрокаТовара.Товар.Наименование;
		СтрокаТовара.ЦенаРеализации		= СтрокаТовара.Цена;
		СтрокаТовара.СуммаРеализации	= СтрокаТовара.Сумма;
		СтрокаТовара.Категория			= СтрокаТовара.Товар.Категория;
		СтрокаТовара.Статус				= Перечисления.СтатусыПозицийЗаказа.Дозаказ;
	КонецЦикла;
	
	// специфики в отдельной ТЧ, привязка по номеру строки товара
	Для каждого СтрокаДок Из ТекущаяБронь.Специфики Цикл
		СтрокаТовара = ТаблицаЗаказа.Строки[СтрокаДок.НомерСтрокиТовара-1];
		СтрокаСпецифик = СтрокаТовара.Строки.Добавить();
		СтрокаСпецифик.Товар		= СтрокаДок.Специфика;
		СтрокаСпецифик.Наименование	= " - "+СтрокаДок.Специфика.Наименование;
		СтрокаСпецифик.Статус		= СтрокаТовара.Статус;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Процедура ДействияПередЗакрытиемФормы(ТекущаяФорма, Отказ, ГлавнаяФорма) Экспорт
	Если глФлагБлокировка И (ТекущаяФорма.Модифицированность ИЛИ
		                     ТекущаяФорма.ЭлементыФормы.КнопкаМесто.Заголовок <> "выберите место...") Тогда
		
		Отказ = Истина;
		глФлагБлокировка = Ложь;
		
		БылПользователь = глПользователь;
		глПользователь = Справочники.Сотрудники.ПустаяСсылка();	// чтобы не сработала повторно автоблокировка
		глПользователь = ИнтерфейсРМ.ИдентификацияПользователя();
		
		Пока НЕ( глПользователь=БылПользователь ИЛИ 
				ИнтерфейсРМ.ПроверкаПользователяСмены() ) Цикл
				
			глПользователь = ИнтерфейсРМ.ИдентификацияПользователя();
			
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

ИнициализацияРеквизитов();

#КонецЕсли
